export const kanjiData = [
  { q: "「何」のよみかたは？", a: "なに" }, { q: "「海」のよみかたは？", a: "うみ" },
  { q: "「風」のよみかたは？", a: "かぜ" }, { q: "「家」のよみかたは？", a: "いえ" },
  { q: "「通」のよみかたは？", a: "とおる" }, { q: "「黄色」のよみかたは？", a: "きいろ" },
  { q: "「朝」のよみかたは？", a: "あさ" }, { q: "「昼」のよみかたは？", a: "ひる" },
  { q: "「夜」のよみかたは？", a: "よる" }, { q: "「歩く」のよみかたは？", a: "あるく" },
  { q: "「走る」のよみかたは？", a: "はしる" }, { q: "「止まる」のよみかたは？", a: "とまる" },
  { q: "「強い」のよみかたは？", a: "つよい" }, { q: "「広い」のよみかたは？", a: "ひろい" },
  { q: "「岩」のよみかたは？", a: "いわ" }, { q: "「夏」のよみかたは？", a: "なつ" },
  { q: "「記」のよみかたは？", a: "き" }, { q: "「園」のよみかたは？", a: "えん" },
  { q: "「遠」のよみかたは？", a: "えん" }, { q: "「科」のよみかたは？", a: "か" }
];

export const monsterList = [
  { name: "プルプルスライム", hp: 100, img: "👾", color: "bg-blue-900/40", info: "こたえを ひとつ かくと 10ダメージ！" },
  { name: "獄炎のケルベロス", hp: 300, img: "🐕‍🦺", color: "bg-red-900/40", info: "火の粉を まきちらしている！" },
  { name: "メカ・ガーディアン", hp: 600, img: "🤖", color: "bg-slate-800/60", info: "こうてつの ボディーは かたいぞ！" },
  { name: "古代龍グランギガ", hp: 2500, img: "🐲", color: "bg-purple-900/60", info: "世界を ほろぼす 伝説の龍だ！" }
];

export const weaponList = [
  { name: "ひのつるぎ", power: 20, img: "🔥" },
  { name: "いなずまの杖", power: 45, img: "⚡" },
  { name: "ダイヤモンド剣", power: 100, img: "💎" },
  { name: "マスターソード", power: 300, img: "✨" }
];
